apache/nuttx/arch/arm/src/stm32h7/stm32_xspi.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_xspi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <stdlib.h>
#include <arch/board/board.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/qspi.h>

#include "arm_internal.h"
#include "stm32_gpio.h"
#include "stm32_xspi.h"
#include "hardware/stm32h7rsxx_pwr.h"
#include "hardware/stm32h7rsxx_rcc.h"
#include "hardware/stm32h7rsxx_sbs.h"
#include "hardware/stm32h7rsxx_xspi.h"

#ifdef CONFIG_STM32_XSPI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define XSPI_TIMEOUT 1000000

/* MTYP=5 is a reserved encoding in the DCR1 register */

#define XSPI_MEMTYPE_RESERVED 5

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_xspidev_s
{
  struct qspi_dev_s qspi;
  uint32_t base;
  mutex_t lock;
  uint8_t intf;
  bool initialized;
  bool memmap;
  bool sample_shift;
};

struct stm32_xspi_cmd_s
{
  uint32_t instruction;
  uint32_t address;
  void *buffer;
  size_t buflen;
  uint8_t instruction_lines;
  uint8_t address_lines;
  uint8_t data_lines;
  uint8_t instruction_bits;
  uint8_t address_bits;
  uint8_t dummy_cycles;
  bool dtr;
  bool write;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int xspi_lock(struct qspi_dev_s *dev, bool lock);
static uint32_t xspi_setfrequency(struct qspi_dev_s *dev,
                                  uint32_t frequency);
static void xspi_setmode(struct qspi_dev_s *dev, enum qspi_mode_e mode);
static void xspi_setbits(struct qspi_dev_s *dev, int nbits);
static int xspi_command(struct qspi_dev_s *dev,
                        struct qspi_cmdinfo_s *cmdinfo);
static int xspi_memory(struct qspi_dev_s *dev,
                       struct qspi_meminfo_s *meminfo);
static void *xspi_alloc(struct qspi_dev_s *dev, size_t buflen);
static void xspi_free(struct qspi_dev_s *dev, void *buffer);
static int xspi_mmap_cmd(struct stm32_xspidev_s *priv,
                         const struct qspi_meminfo_s *meminfo,
                         bool write);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct qspi_ops_s g_xspi_ops =
{
  .lock         = xspi_lock,
  .setfrequency = xspi_setfrequency,
  .setmode      = xspi_setmode,
  .setbits      = xspi_setbits,
  .command      = xspi_command,
  .memory       = xspi_memory,
  .alloc        = xspi_alloc,
  .free         = xspi_free,
};

static struct stm32_xspidev_s g_xspi1dev =
{
  .qspi =
  {
    .ops = &g_xspi_ops,
  },
  .base = STM32_XSPI1_R_BASE,
  .lock = NXMUTEX_INITIALIZER,
  .intf = 1,
};

static struct stm32_xspidev_s g_xspi2dev =
{
  .qspi =
  {
    .ops = &g_xspi_ops,
  },
  .base = STM32_XSPI2_R_BASE,
  .lock = NXMUTEX_INITIALIZER,
  .intf = 2,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: xspi_getreg
 *
 * Description:
 *   Read an XSPI register.
 *
 ****************************************************************************/

static inline uint32_t xspi_getreg(struct stm32_xspidev_s *priv,
                                   uint32_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: xspi_putreg
 *
 * Description:
 *   Write a value to an XSPI register.
 *
 ****************************************************************************/

static inline void xspi_putreg(struct stm32_xspidev_s *priv,
                               uint32_t offset, uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: xspi_device
 *
 * Description:
 *   Map an XSPI interface number to its device state structure.
 *
 ****************************************************************************/

static struct stm32_xspidev_s *xspi_device(int intf)
{
  if (intf == 1)
    {
      return &g_xspi1dev;
    }

  if (intf == 2)
    {
      return &g_xspi2dev;
    }

  return NULL;
}

/****************************************************************************
 * Name: xspi_wait
 *
 * Description:
 *   Poll until the masked status register bits equal the given value.
 *
 ****************************************************************************/

static int xspi_wait(struct stm32_xspidev_s *priv, uint32_t mask,
                     uint32_t value)
{
  int timeout;

  for (timeout = XSPI_TIMEOUT; timeout > 0; timeout--)
    {
      uint32_t status = xspi_getreg(priv, STM32_XSPI_SR_OFFSET);

      if ((status & XSPI_SR_TEF) != 0)
        {
          xspi_putreg(priv, STM32_XSPI_FCR_OFFSET, XSPI_FCR_CTEF);
          return -EIO;
        }

      if ((status & mask) == value)
        {
          return OK;
        }
    }

