apache/nuttx/arch/arm/src/stm32h7/stm32_xspi.c
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: xspi_wait_any
 *
 * Description:
 *   Poll until any of the masked status register bits is set.
 *
 ****************************************************************************/

static int xspi_wait_any(struct stm32_xspidev_s *priv, uint32_t mask)
{
  int timeout;

  for (timeout = XSPI_TIMEOUT; timeout > 0; timeout--)
    {
      uint32_t status = xspi_getreg(priv, STM32_XSPI_SR_OFFSET);

      if ((status & XSPI_SR_TEF) != 0)
        {
          xspi_putreg(priv, STM32_XSPI_FCR_OFFSET, XSPI_FCR_CTEF);
          return -EIO;
        }

      if ((status & mask) != 0)
        {
          return OK;
        }
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: xspi_size
 *
 * Description:
 *   Convert a bit width (8/16/24/32) to the CCR SIZE field encoding.
 *
 ****************************************************************************/

static int xspi_size(uint8_t bits)
{
  if (bits == 8 || bits == 16 || bits == 24 || bits == 32)
    {
      return (bits >> 3) - 1;
    }

  return -EINVAL;
}

/****************************************************************************
 * Name: xspi_lines
 *
 * Description:
 *   Convert a line count (0/1/2/4/8) to the CCR MODE field encoding.
 *
 ****************************************************************************/

static int xspi_lines(uint8_t lines)
{
  switch (lines)
    {
      case 0:
        return 0;
      case 1:
        return 1;
      case 2:
        return 2;
      case 4:
        return 3;
      case 8:
        return 4;
      default:
        return -EINVAL;
    }
}

/****************************************************************************
 * Name: xspi_ccr
 *
 * Description:
 *   Build the CCR register value for a transfer command.
 *
 ****************************************************************************/

static int xspi_ccr(const struct stm32_xspi_cmd_s *cmd, uint32_t *ccr)
{
  uint32_t reg = 0;
  int lines;
  int size;

  lines = xspi_lines(cmd->instruction_lines);
  if (lines < 0)
    {
      return lines;
    }

  if (lines != 0)
    {
      size = xspi_size(cmd->instruction_bits);
      if (size < 0)
        {
          return size;
        }

      reg |= XSPI_CCR_IMODE(lines) | XSPI_CCR_ISIZE(size);
      if (cmd->dtr)
        {
          reg |= XSPI_CCR_IDTR;
        }
    }

  lines = xspi_lines(cmd->address_lines);
  if (lines < 0)
    {
      return lines;
    }

  if (lines != 0)
    {
      size = xspi_size(cmd->address_bits);
      if (size < 0)
        {
          return size;
        }

      reg |= XSPI_CCR_ADMODE(lines) | XSPI_CCR_ADSIZE(size);
      if (cmd->dtr)
        {
          reg |= XSPI_CCR_ADDTR;
        }
    }

  lines = xspi_lines(cmd->data_lines);
  if (lines < 0)
    {
      return lines;
    }

  reg |= XSPI_CCR_DMODE(lines);
  if (cmd->dtr && lines != 0)
    {
      reg |= XSPI_CCR_DDTR;
    }

  if (cmd->dummy_cycles > 31)
    {
      return -EINVAL;
    }

  *ccr = reg;
  return OK;
}

/****************************************************************************
 * Name: xspi_iom_config
 *
 * Description:
 *   Configure the XSPI I/O manager port and chip select routing.
 *
 ****************************************************************************/

static void xspi_iom_config(struct stm32_xspidev_s *priv,
                            const struct stm32_xspi_config_s *config)
{
  enum stm32_xspi_iomport_e port1;
  enum stm32_xspi_iomport_e port2;
  enum stm32_xspi_cs_e cs1;
  enum stm32_xspi_cs_e cs2;
  uint32_t xspi1cr;
  uint32_t xspi2cr;
  uint32_t reg;

  reg = getreg32(STM32_XSPIM_CR);
  port1 = (reg & XSPIM_CR_MODE) != 0 ? STM32_XSPI_IOM_PORT2 :
                                      STM32_XSPI_IOM_PORT1;
  port2 = ((reg & XSPIM_CR_MUXEN) != 0) !=
          ((reg & XSPIM_CR_MODE) != 0) ? STM32_XSPI_IOM_PORT1 :
                                        STM32_XSPI_IOM_PORT2;

  if ((reg & XSPIM_CR_CSSEL_OVR_EN) == 0)
    {
      cs1 = STM32_XSPI_CS_DISABLED;
      cs2 = STM32_XSPI_CS_DISABLED;
    }
  else
    {
      cs1 = (reg & XSPIM_CR_CSSEL_OVR_O1) != 0 ? STM32_XSPI_CS_NCS2 :
                                                 STM32_XSPI_CS_NCS1;
      cs2 = (reg & XSPIM_CR_CSSEL_OVR_O2) != 0 ? STM32_XSPI_CS_NCS2 :
                                                 STM32_XSPI_CS_NCS1;
    }

  if (priv->intf == 1)
    {
      port1 = config->iomport;
      cs1   = config->cs_override;
    }
  else
    {
      port2 = config->iomport;
      cs2   = config->cs_override;
    }

  reg = XSPIM_CR_REQ2ACK(config->req2ack);
  if (port1 == port2)
    {
      reg |= XSPIM_CR_MUXEN;
    }

  if (port1 == STM32_XSPI_IOM_PORT2)
    {
      reg |= XSPIM_CR_MODE;
    }

  if (cs1 != STM32_XSPI_CS_DISABLED || cs2 != STM32_XSPI_CS_DISABLED)
    {
      reg |= XSPIM_CR_CSSEL_OVR_EN;
    }

  if (cs1 == STM32_XSPI_CS_NCS2)
    {
      reg |= XSPIM_CR_CSSEL_OVR_O1;
    }

  if (cs2 == STM32_XSPI_CS_NCS2)
    {
      reg |= XSPIM_CR_CSSEL_OVR_O2;
    }

  xspi1cr = getreg32(STM32_XSPI1_CR);
  xspi2cr = getreg32(STM32_XSPI2_CR);
  modifyreg32(STM32_XSPI1_CR, XSPI_CR_EN, 0);
  modifyreg32(STM32_XSPI2_CR, XSPI_CR_EN, 0);
  putreg32(reg, STM32_XSPIM_CR);
  putreg32(xspi1cr, STM32_XSPI1_CR);
  putreg32(xspi2cr, STM32_XSPI2_CR);
}

/****************************************************************************
 * Name: xspi_compensation_enable
 *
 * Description:
 *   Enable the XSPI I/O compensation cell and wait until it is ready.
 *
 ****************************************************************************/

static int xspi_compensation_enable(struct stm32_xspidev_s *priv)
{
  uint32_t enable;
  uint32_t ready;
  int timeout;

  modifyreg32(STM32_RCC_APB4ENR, 0, RCC_APB4ENR_SBSEN);
  modifyreg32(STM32_RCC_CR, 0, RCC_CR_CSION);

  for (timeout = XSPI_TIMEOUT; timeout > 0; timeout--)
    {
      if ((getreg32(STM32_RCC_CR) & RCC_CR_CSIRDY) != 0)
        {
          break;
        }
    }

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }

  if (priv->intf == 1)
    {
      enable = SBS_CCCSR_XSPI1_COMP_EN | SBS_CCCSR_XSPI1_IOHSLV;
      ready  = SBS_CCCSR_XSPI1_COMP_RDY;
    }
  else
    {
      enable = SBS_CCCSR_XSPI2_COMP_EN | SBS_CCCSR_XSPI2_IOHSLV;
      ready  = SBS_CCCSR_XSPI2_COMP_RDY;
    }

  modifyreg32(STM32_SBS_CCCSR, 0, enable);
  for (timeout = XSPI_TIMEOUT; timeout > 0; timeout--)
    {
      if ((getreg32(STM32_SBS_CCCSR) & ready) != 0)
        {
          return OK;
        }
    }

