apache/nuttx/arch/arm/src/stm32h7/stm32_xspi.c
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: xspi_hw_initialize
 *
 * Description:
 *   One-time hardware initialization: power, clocking and GPIO pins.
 *
 ****************************************************************************/

static int xspi_hw_initialize(struct stm32_xspidev_s *priv)
{
  if (priv->intf == 1)
    {
      modifyreg32(STM32_PWR_CSR2, 0, PWR_CSR2_EN_XSPIM1);
      modifyreg32(STM32_RCC_CCIPR1, RCC_CCIPR1_XSPI1SEL_MASK,
                  RCC_CCIPR1_XSPI1SEL_HCLK);
      modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_XSPI1EN |
                   RCC_AHB5ENR_XSPIMEN);

#ifdef GPIO_XSPI1_CLK
      stm32_configgpio(GPIO_XSPI1_CLK);
#endif
#ifdef GPIO_XSPI1_DQS
      stm32_configgpio(GPIO_XSPI1_DQS);
#endif
#ifdef GPIO_XSPI1_NCS
      stm32_configgpio(GPIO_XSPI1_NCS);
#endif
#ifdef GPIO_XSPI1_IO0
      stm32_configgpio(GPIO_XSPI1_IO0);
#endif
#ifdef GPIO_XSPI1_IO1
      stm32_configgpio(GPIO_XSPI1_IO1);
#endif
#ifdef GPIO_XSPI1_IO2
      stm32_configgpio(GPIO_XSPI1_IO2);
#endif
#ifdef GPIO_XSPI1_IO3
      stm32_configgpio(GPIO_XSPI1_IO3);
#endif
#ifdef GPIO_XSPI1_IO4
      stm32_configgpio(GPIO_XSPI1_IO4);
#endif
#ifdef GPIO_XSPI1_IO5
      stm32_configgpio(GPIO_XSPI1_IO5);
#endif
#ifdef GPIO_XSPI1_IO6
      stm32_configgpio(GPIO_XSPI1_IO6);
#endif
#ifdef GPIO_XSPI1_IO7
      stm32_configgpio(GPIO_XSPI1_IO7);
#endif
    }
  else
    {
      modifyreg32(STM32_PWR_CSR2, 0, PWR_CSR2_EN_XSPIM2);
      modifyreg32(STM32_RCC_CCIPR1, RCC_CCIPR1_XSPI2SEL_MASK,
                  RCC_CCIPR1_XSPI2SEL_HCLK);
      modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_XSPI2EN |
                   RCC_AHB5ENR_XSPIMEN);

#ifdef GPIO_XSPI2_CLK
      stm32_configgpio(GPIO_XSPI2_CLK);
#endif
#ifdef GPIO_XSPI2_DQS
      stm32_configgpio(GPIO_XSPI2_DQS);
#endif
#ifdef GPIO_XSPI2_NCS
      stm32_configgpio(GPIO_XSPI2_NCS);
#endif
#ifdef GPIO_XSPI2_IO0
      stm32_configgpio(GPIO_XSPI2_IO0);
#endif
#ifdef GPIO_XSPI2_IO1
      stm32_configgpio(GPIO_XSPI2_IO1);
#endif
#ifdef GPIO_XSPI2_IO2
      stm32_configgpio(GPIO_XSPI2_IO2);
#endif
#ifdef GPIO_XSPI2_IO3
      stm32_configgpio(GPIO_XSPI2_IO3);
#endif
#ifdef GPIO_XSPI2_IO4
      stm32_configgpio(GPIO_XSPI2_IO4);
#endif
#ifdef GPIO_XSPI2_IO5
      stm32_configgpio(GPIO_XSPI2_IO5);
#endif
#ifdef GPIO_XSPI2_IO6
      stm32_configgpio(GPIO_XSPI2_IO6);
#endif
#ifdef GPIO_XSPI2_IO7
      stm32_configgpio(GPIO_XSPI2_IO7);
#endif
    }

  return xspi_compensation_enable(priv);
}

/****************************************************************************
 * Name: xspi_lock
 *
 * Description:
 *   Lock or unlock the XSPI bus for exclusive access.
 *
 ****************************************************************************/

static int xspi_lock(struct qspi_dev_s *dev, bool lock)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;

  return lock ? nxmutex_lock(&priv->lock) : nxmutex_unlock(&priv->lock);
}

/****************************************************************************
 * Name: xspi_setfrequency
 *
 * Description:
 *   Set the XSPI frequency and return the actual frequency selected.
 *
 ****************************************************************************/

static uint32_t xspi_setfrequency(struct qspi_dev_s *dev,
                                  uint32_t frequency)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;
  uint32_t prescaler;

  if (frequency == 0)
    {
      return 0;
    }

  prescaler = (STM32_HCLK_FREQUENCY + frequency - 1) / frequency;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 256)
    {
      prescaler = 256;
    }

  modifyreg32(priv->base + STM32_XSPI_DCR2_OFFSET,
              XSPI_DCR2_PRESCALER_MASK,
              XSPI_DCR2_PRESCALER(prescaler - 1));
  return STM32_HCLK_FREQUENCY / prescaler;
}

/****************************************************************************
 * Name: xspi_setmode
 *
 * Description:
 *   Set the XSPI clock mode (mode 0 or mode 3).
 *
 ****************************************************************************/

static void xspi_setmode(struct qspi_dev_s *dev, enum qspi_mode_e mode)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;

  DEBUGASSERT(mode == QSPIDEV_MODE0 || mode == QSPIDEV_MODE3);
  modifyreg32(priv->base + STM32_XSPI_DCR1_OFFSET, XSPI_DCR1_CKMODE,
              mode == QSPIDEV_MODE3 ? XSPI_DCR1_CKMODE : 0);
}

/****************************************************************************
 * Name: xspi_setbits
 *
 * Description:
 *   Set the number of bits per word (only 8 bits are supported).
 *
 ****************************************************************************/

static void xspi_setbits(struct qspi_dev_s *dev, int nbits)
{
  UNUSED(dev);
  DEBUGASSERT(nbits == 8);
}

/****************************************************************************
 * Name: xspi_configure
 *
 * Description:
 *   Validate the configuration and program the XSPI device registers.
 *
 ****************************************************************************/

static int xspi_configure(struct stm32_xspidev_s *priv,
                          const struct stm32_xspi_config_s *config)
{
  uint32_t dcr1;
  uint32_t cr;
  int ret;

  if (config == NULL || config->memtype == XSPI_MEMTYPE_RESERVED ||
      config->memtype > STM32_XSPI_MEMTYPE_APMEM_16BIT ||
      config->iomport > STM32_XSPI_IOM_PORT2 ||
      config->cs_override > STM32_XSPI_CS_NCS2 || config->devsize > 31 ||
      config->csht < 1 || config->csht > 64 || config->fthres < 1 ||
      config->fthres > 32 || config->wrapsize > 7 ||
      config->csbound > 31 || config->req2ack < 1 ||
      config->req2ack > 256)
    {
      return -EINVAL;
    }

  ret = xspi_wait(priv, XSPI_SR_BUSY, 0);
  if (ret < 0)
    {
      return ret;
    }

  cr = xspi_getreg(priv, STM32_XSPI_CR_OFFSET);
  xspi_putreg(priv, STM32_XSPI_CR_OFFSET, cr & ~XSPI_CR_EN);
  xspi_iom_config(priv, config);

  dcr1 = XSPI_DCR1_CSHT(config->csht) |
         XSPI_DCR1_DEVSIZE(config->devsize) |
         XSPI_DCR1_MTYP(config->memtype);
  if (config->clock_mode3)
    {
      dcr1 |= XSPI_DCR1_CKMODE;
    }

