apache/nuttx/arch/arm/src/stm32h7/stm32_xspi.c
  if (config->free_running)
    {
      dcr1 |= XSPI_DCR1_FRCK;
    }

  xspi_putreg(priv, STM32_XSPI_DCR1_OFFSET, dcr1);
  xspi_putreg(priv, STM32_XSPI_DCR2_OFFSET,
              XSPI_DCR2_PRESCALER(config->prescaler) |
              XSPI_DCR2_WRAPSIZE(config->wrapsize));
  xspi_putreg(priv, STM32_XSPI_DCR3_OFFSET,
              XSPI_DCR3_MAXTRAN(config->maxtran) |
              XSPI_DCR3_CSBOUND(config->csbound));
  xspi_putreg(priv, STM32_XSPI_DCR4_OFFSET, config->refresh);

  priv->sample_shift = config->sample_shift;
  cr &= ~(XSPI_CR_FTHRES_MASK | XSPI_CR_FMODE_MASK);
  cr |= XSPI_CR_FTHRES(config->fthres) | XSPI_CR_EN;
  xspi_putreg(priv, STM32_XSPI_CR_OFFSET, cr);
  return OK;
}

/****************************************************************************
 * Name: xspi_transfer
 *
 * Description:
 *   Execute a single polled indirect-mode transfer.
 *
 ****************************************************************************/

static int xspi_transfer(struct stm32_xspidev_s *priv,
                         const struct stm32_xspi_cmd_s *cmd)
{
  uint8_t *buffer;
  uint32_t ccr;
  uint32_t tcr;
  uint32_t fmode;
  size_t remaining;
  int ret;

  if (cmd == NULL || (cmd->buflen > 0 && cmd->buffer == NULL) ||
      (cmd->buflen > 0 && cmd->data_lines == 0) ||
      (cmd->buflen == 0 && cmd->data_lines != 0))
    {
      return -EINVAL;
    }

  ret = xspi_ccr(cmd, &ccr);
  if (ret < 0)
    {
      return ret;
    }

  ret = xspi_wait(priv, XSPI_SR_BUSY, 0);
  if (ret < 0)
    {
      return ret;
    }

  xspi_putreg(priv, STM32_XSPI_FCR_OFFSET, XSPI_FCR_ALL);
  if (cmd->buflen > 0)
    {
      xspi_putreg(priv, STM32_XSPI_DLR_OFFSET, cmd->buflen - 1);
    }

  tcr = XSPI_TCR_DCYC(cmd->dummy_cycles);
  if (priv->sample_shift && !cmd->dtr)
    {
      tcr |= XSPI_TCR_SSHIFT;
    }

  xspi_putreg(priv, STM32_XSPI_CCR_OFFSET, ccr);
  xspi_putreg(priv, STM32_XSPI_TCR_OFFSET, tcr);
  fmode = cmd->write ? XSPI_CR_FMODE_WRITE : XSPI_CR_FMODE_READ;
  modifyreg32(priv->base + STM32_XSPI_CR_OFFSET, XSPI_CR_FMODE_MASK,
              fmode);

  xspi_putreg(priv, STM32_XSPI_IR_OFFSET, cmd->instruction);
  if (cmd->address_lines != 0)
    {
      xspi_putreg(priv, STM32_XSPI_AR_OFFSET, cmd->address);
    }

  if (cmd->buflen == 0)
    {
      ret = xspi_wait(priv, XSPI_SR_BUSY, 0);
      xspi_putreg(priv, STM32_XSPI_FCR_OFFSET, XSPI_FCR_CTCF);
      return ret;
    }

  buffer = cmd->buffer;
  remaining = cmd->buflen;
  while (remaining > 0)
    {
      uint32_t flags = cmd->write ? XSPI_SR_FTF :
                                    (XSPI_SR_FTF | XSPI_SR_TCF);

      ret = xspi_wait_any(priv, flags);
      if (ret < 0)
        {
          break;
        }

      if (cmd->write)
        {
          putreg8(*buffer, priv->base + STM32_XSPI_DR_OFFSET);
        }
      else
        {
          *buffer = getreg8(priv->base + STM32_XSPI_DR_OFFSET);
        }

      buffer++;
      remaining--;
    }

  if (ret == OK)
    {
      ret = xspi_wait(priv, XSPI_SR_TCF, XSPI_SR_TCF);
    }

  xspi_putreg(priv, STM32_XSPI_FCR_OFFSET,
              XSPI_FCR_CTEF | XSPI_FCR_CTCF);
  return ret;
}

/****************************************************************************
 * Name: xspi_instruction_lines
 *
 * Description:
 *   Get the instruction line count from command or memory transfer flags.
 *
 ****************************************************************************/

static uint8_t xspi_instruction_lines(uint16_t flags, bool memory)
{
  if (memory ? QSPIMEM_ISIOCTAL(flags) : QSPICMD_ISIOCTAL(flags))
    {
      return 8;
    }

  if (memory ? QSPIMEM_ISIQUAD(flags) : QSPICMD_ISIQUAD(flags))
    {
      return 4;
    }

  if (memory ? QSPIMEM_ISIDUAL(flags) : QSPICMD_ISIDUAL(flags))
    {
      return 2;
    }

  return 1;
}

/****************************************************************************
 * Name: xspi_command
 *
 * Description:
 *   Perform one QSPI command transaction.
 *
 ****************************************************************************/

static int xspi_command(struct qspi_dev_s *dev,
                        struct qspi_cmdinfo_s *cmdinfo)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;
  struct stm32_xspi_cmd_s cmd;

  if (cmdinfo == NULL || cmdinfo->addrlen > 4 ||
      (QSPICMD_ISDATA(cmdinfo->flags) && cmdinfo->buffer == NULL))
    {
      return -EINVAL;
    }

  cmd.instruction       = cmdinfo->cmd;
  cmd.address           = cmdinfo->addr;
  cmd.buffer            = cmdinfo->buffer;
  cmd.buflen            = QSPICMD_ISDATA(cmdinfo->flags) ?
                          cmdinfo->buflen : 0;
  cmd.instruction_lines = xspi_instruction_lines(cmdinfo->flags, false);
  cmd.address_lines     = QSPICMD_ISADDRESS(cmdinfo->flags) ?
                          (QSPICMD_ISOCTALIO(cmdinfo->flags) ? 8 : 1) : 0;
  cmd.data_lines        = QSPICMD_ISDATA(cmdinfo->flags) ?
                          (QSPICMD_ISOCTALIO(cmdinfo->flags) ? 8 : 1) : 0;
  cmd.instruction_bits  = QSPICMD_ISIOCTAL(cmdinfo->flags) ? 16 : 8;
  cmd.address_bits      = cmdinfo->addrlen * 8;
  cmd.dummy_cycles      = 0;
  cmd.dtr               = QSPICMD_ISDTR(cmdinfo->flags);
  cmd.write             = !QSPICMD_ISREAD(cmdinfo->flags);
  return xspi_transfer(priv, &cmd);
}

/****************************************************************************
 * Name: xspi_memory
 *
 * Description:
 *   Perform one QSPI memory transfer.
 *
 ****************************************************************************/

static int xspi_memory(struct qspi_dev_s *dev,
                       struct qspi_meminfo_s *meminfo)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;
  struct stm32_xspi_cmd_s cmd;

  if (meminfo == NULL || meminfo->addrlen > 4 ||
      meminfo->buflen == 0 || meminfo->buffer == NULL ||
      meminfo->dummies > 31)
    {
      return -EINVAL;
    }

  cmd.instruction       = meminfo->cmd;
  cmd.address           = meminfo->addr;
  cmd.buffer            = meminfo->buffer;
  cmd.buflen            = meminfo->buflen;
  cmd.instruction_lines = xspi_instruction_lines(meminfo->flags, true);
  cmd.address_lines     = meminfo->addrlen == 0 ? 0 :
                          QSPIMEM_ISOCTALIO(meminfo->flags) ? 8 :
                          QSPIMEM_ISQUADIO(meminfo->flags) ? 4 :
                          QSPIMEM_ISDUALIO(meminfo->flags) ? 2 : 1;
  cmd.data_lines        = QSPIMEM_ISOCTALIO(meminfo->flags) ? 8 :
                          (QSPIMEM_ISQUADIO(meminfo->flags) ||
                           QSPIMEM_ISQUADDATA(meminfo->flags)) ? 4 :
                          QSPIMEM_ISDUALIO(meminfo->flags) ? 2 : 1;
  cmd.instruction_bits  = QSPIMEM_ISIOCTAL(meminfo->flags) ? 16 : 8;
  cmd.address_bits      = meminfo->addrlen * 8;
  cmd.dummy_cycles      = meminfo->dummies;
  cmd.dtr               = QSPIMEM_ISDTR(meminfo->flags);
  cmd.write             = QSPIMEM_ISWRITE(meminfo->flags);
  return xspi_transfer(priv, &cmd);
}

/****************************************************************************
 * Name: xspi_alloc
 *
 * Description:
 *   Allocate a buffer suitable for XSPI transfers.
 *
 ****************************************************************************/

