apache/nuttx/arch/arm/src/stm32h7/stm32_xspi.c
static void *xspi_alloc(struct qspi_dev_s *dev, size_t buflen)
{
  UNUSED(dev);
  return kmm_malloc(buflen);
}

/****************************************************************************
 * Name: xspi_free
 *
 * Description:
 *   Free a buffer allocated by xspi_alloc.
 *
 ****************************************************************************/

static void xspi_free(struct qspi_dev_s *dev, void *buffer)
{
  UNUSED(dev);
  kmm_free(buffer);
}

/****************************************************************************
 * Name: xspi_mmap_cmd
 *
 * Description:
 *   Program the read or write command registers for memory-mapped mode.
 *
 ****************************************************************************/

static int xspi_mmap_cmd(struct stm32_xspidev_s *priv,
                         const struct qspi_meminfo_s *meminfo,
                         bool write)
{
  struct stm32_xspi_cmd_s cmd;
  uint32_t ccr_offset = write ? STM32_XSPI_WCCR_OFFSET :
                                STM32_XSPI_CCR_OFFSET;
  uint32_t tcr_offset = write ? STM32_XSPI_WTCR_OFFSET :
                                STM32_XSPI_TCR_OFFSET;
  uint32_t ir_offset  = write ? STM32_XSPI_WIR_OFFSET :
                                STM32_XSPI_IR_OFFSET;
  uint32_t ccr;
  uint32_t tcr;
  int ret;

  if (meminfo == NULL || meminfo->addrlen == 0 || meminfo->addrlen > 4 ||
      meminfo->dummies > 31)
    {
      return -EINVAL;
    }

  cmd.instruction       = meminfo->cmd;
  cmd.address           = 0;
  cmd.buffer            = NULL;
  cmd.buflen            = 0;
  cmd.instruction_lines = xspi_instruction_lines(meminfo->flags, true);
  cmd.address_lines     = QSPIMEM_ISOCTALIO(meminfo->flags) ? 8 :
                          QSPIMEM_ISQUADIO(meminfo->flags) ? 4 :
                          QSPIMEM_ISDUALIO(meminfo->flags) ? 2 : 1;
  cmd.data_lines        = QSPIMEM_ISOCTALIO(meminfo->flags) ? 8 :
                          (QSPIMEM_ISQUADIO(meminfo->flags) ||
                           QSPIMEM_ISQUADDATA(meminfo->flags)) ? 4 :
                          QSPIMEM_ISDUALIO(meminfo->flags) ? 2 : 1;
  cmd.instruction_bits  = QSPIMEM_ISIOCTAL(meminfo->flags) ? 16 : 8;
  cmd.address_bits      = meminfo->addrlen * 8;
  cmd.dummy_cycles      = meminfo->dummies;
  cmd.dtr               = QSPIMEM_ISDTR(meminfo->flags);
  cmd.write             = write;

  ret = xspi_ccr(&cmd, &ccr);
  if (ret < 0)
    {
      return ret;
    }

  tcr = XSPI_TCR_DCYC(cmd.dummy_cycles);
  if (priv->sample_shift && !cmd.dtr)
    {
      tcr |= XSPI_TCR_SSHIFT;
    }

  xspi_putreg(priv, ccr_offset, ccr);
  xspi_putreg(priv, tcr_offset, tcr);
  xspi_putreg(priv, ir_offset, cmd.instruction);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_xspi_initialize
 *
 * Description:
 *   Initialize an XSPI controller.
 *
 * Input Parameters:
 *   intf   - XSPI controller number (1 or 2)
 *   config - XSPI controller configuration
 *
 * Returned Value:
 *   Valid QSPI device structure on success; NULL on failure.
 *
 ****************************************************************************/

struct qspi_dev_s *
stm32_xspi_initialize(int intf, const struct stm32_xspi_config_s *config)
{
  struct stm32_xspidev_s *priv = xspi_device(intf);
  int ret;

  if (priv == NULL || config == NULL)
    {
      return NULL;
    }

  if (!priv->initialized)
    {
      ret = xspi_hw_initialize(priv);
      if (ret < 0)
        {
          return NULL;
        }

      priv->initialized = true;
    }

  if (xspi_configure(priv, config) < 0)
    {
      return NULL;
    }

  return &priv->qspi;
}

/****************************************************************************
 * Name: stm32_xspi_enter_memorymapped
 *
 * Description:
 *   Configure the XSPI controller for memory-mapped access.
 *
 * Input Parameters:
 *   dev       - QSPI device
 *   readinfo  - Memory transfer parameters used for reading
 *   writeinfo - Memory transfer parameters used for writing; may be NULL
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

int stm32_xspi_enter_memorymapped(
  struct qspi_dev_s *dev,
  const struct qspi_meminfo_s *readinfo,
  const struct qspi_meminfo_s *writeinfo)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;
  uint32_t cr;
  int ret;

  if (dev == NULL || dev->ops != &g_xspi_ops)
    {
      return -EINVAL;
    }

  ret = xspi_lock(dev, true);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->memmap)
    {
      xspi_lock(dev, false);
      return OK;
    }

  ret = xspi_wait(priv, XSPI_SR_BUSY, 0);
  if (ret < 0)
    {
      goto errout;
    }

  cr = xspi_getreg(priv, STM32_XSPI_CR_OFFSET);
  xspi_putreg(priv, STM32_XSPI_CR_OFFSET, cr & ~XSPI_CR_EN);

  ret = xspi_mmap_cmd(priv, readinfo, false);
  if (ret == OK && writeinfo != NULL)
    {
      ret = xspi_mmap_cmd(priv, writeinfo, true);
    }

  if (ret < 0)
    {
      xspi_putreg(priv, STM32_XSPI_CR_OFFSET, cr);
      goto errout;
    }

  cr &= ~XSPI_CR_FMODE_MASK;
  cr |= XSPI_CR_EN | XSPI_CR_FMODE_MEMORY;
  xspi_putreg(priv, STM32_XSPI_CR_OFFSET, cr);
  priv->memmap = true;
  xspi_lock(dev, false);
  return OK;

errout:
  xspi_lock(dev, false);
  return ret;
}

/****************************************************************************
 * Name: stm32_xspi_exit_memorymapped
 *
 * Description:
 *   Take the XSPI device out of memory-mapped mode.
 *
 * Input Parameters:
 *   dev - QSPI device
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void stm32_xspi_exit_memorymapped(struct qspi_dev_s *dev)
{
  struct stm32_xspidev_s *priv = (struct stm32_xspidev_s *)dev;

  if (dev == NULL || dev->ops != &g_xspi_ops)
    {
      return;
    }

  xspi_lock(dev, true);
  modifyreg32(priv->base + STM32_XSPI_CR_OFFSET, 0, XSPI_CR_ABORT);
  xspi_wait(priv, XSPI_SR_BUSY, 0);
  modifyreg32(priv->base + STM32_XSPI_CR_OFFSET,
              XSPI_CR_ABORT | XSPI_CR_FMODE_MASK,
              XSPI_CR_FMODE_WRITE);
  priv->memmap = false;
  xspi_lock(dev, false);
}

#endif /* CONFIG_STM32_XSPI */
